Autodesk.Revit.DB.FillPatternElement.GetFillPatternElementByName(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FillPatternTarget,System.String)
Retrieves the FillPatternElement by its name.
document:
The document in which to retrieve the FillPatternElement.
target:
The FillPatternTarget of the FillPatternElement.
name:
The name of the FillPatternElement.
Returns:
The FillPatternElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.FillPatternElement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FillPattern)
Creates a new FillPatternElement.
document:
The document in which to create the FillPatternElement.
fillPattern:
The FillPattern associated to the newly created FillPatternElement.
Returns:
The newly created FillPatternElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.FillPatternElement.SetFillPattern(Autodesk.Revit.DB.FillPattern)
Sets the FillPattern associated to this element.
Remarks:
The data stored inside the input FillPattern will be copied into this element.
The input FillPattern itself will not be associated with the element.
newFillPattern:
The new FillPattern object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.FillPatternElement.GetFillPattern
Gets the FillPattern associated to this element.
Returns:
A copy of FillPattern object.
Since:
2012

Autodesk.Revit.DB.FillPatternElement
An element that represents a fill pattern.
Remarks:
The FillPatternElement represents a fill pattern in a project.
It enables the user to retrieve, modify or create a fill pattern in a project.
Since:
2012